Revit 2024 API
SlabShapeVertex Members
The SlabShapeVertex type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Position
The position of the vertex.
VertexType
The type of the vertex.
See Also
SlabShapeVertex Class
Autodesk.Revit.DB Namespace